# ExecuteService Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalServiceRegistry..::..ExecuteService Method
ExternalServiceRegistry Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExecuteService(Guid, IExternalData) | Execute a service independently of any document. |
| ExecuteService(Guid, Document, IExternalData) | Execute the service for the given document. |
| ExecuteService(Guid, Guid, IExternalData) | Execute the service by the given server. |

# See Also
ExternalServiceRegistry Class
ExternalServiceRegistry Members
Autodesk.Revit.DB.ExternalService Namespace